show tables;
desc players;
drop table players;

/*
	시간관련 데이터 타입 
    date : 날짜 (YYYY-MM-DD)
    datetime : YYYY-MM-DD hh:mm:ss
	time : hh:mm:ss
    year : YYYY
    timestamp : == datetime 이랑 비슷함/ 
*/

create table players (
    code INT NOT NULL AUTO_INCREMENT,
    name VARCHAR(20) NOT NULL,
    birth DATE,    height INT,    weight INT,    elementary VARCHAR(30),    middle VARCHAR(30),
    high VARCHAR(30),    extra VARCHAR(30),    position VARCHAR(30),    hittype VARCHAR(30),
    indate YEAR,    money INT,    promise INT,    backno VARCHAR(10),    entry INT,
    PRIMARY KEY (code)
);

insert into players( name, birth, height, weight, elementary, middle, high, extra, position, hittype, indate, money, promise, backno, entry) 
	values ("신명승", "2002-11-02", 183, 94, "수창초", "진흥중", "진흥고", null , "포수", "우투우타", 2022, 3000, 3000, "042", 3)
, ("신범수", "1998-01-25", 177, 83, "광주대성초", "광주동성중", "광주동성고", null , "포수", "우투좌타", 2016, 3600, 4000, "22", 1)
, ("오정환", "1999-03-27", 185, 75, "강남초", "자양중", "경기고", null , "내야수", "우투좌타", 2018, 3100, 0, "2", 1)
, ("임석진", "1997-10-10", 180, 98, "군산신풍초", "서울이수중", "서울고", null , "내야수", "우투우타", 0, 3000, 13000, "28", 1)
, ("강이준", "1998-04-07", 190, 86, "발산초", "덕수중", "구리인창고", null , "투수", "우투우타", 2017, 3000, 7000, "36", 1)
, ("고영창", "1989-02-24", 189, 100, "광주서림초", "진흥중", "진흥고", "연세대" , "투수", "우투우타", 2013, 4200, 5000, "60", 1)
, ("김양수", "2001-01-23", 184, 88, "", "천안북중", "천안북일고", null , "투수", "우투우타", 2020, 3000, 6000, "013", 3)
, ("김재열", "1996-01-02", 183, 97, "양정초", "개성중", "부산고", null , "투수", "우투우타", 2014, 3900, 3000, "32", 1)
, ("양현종", "1988-03-01", 183, 91, "학강초", "동성중", "동성고", null , "투수", "좌투좌타", 2007, 100000, 20000, "54", 1)
, ("윤중현", "1995-04-25", 180, 84, "서석초", "무등중", "광주일고", "성균관대" , "투수", "우투우타", 2018, 6500, 4000, "19", 1)
, ("이준형", "1993-06-03", 186, 82, "수주초", "양천중", "서울고", "대구사이버대" , "투수", "우투우타", 2021, 3500, 0, "012", 3)
, ("장지수", "2000-05-25", 179, 83, "사당초", "강남중", "성남고", null , "투수", "우투우타", 2019, 3200, 10000, "16", 1)
, ("정해영", "2001-08-23", 189, 98, "광주대성초", "광주동성중", "광주제일고", null , "투수", "우투우타", 2020, 17000, 20000, "62", 1)
, ("오선우", "1996-12-13", 186, 95, "성동초", "자양중", "배명고", "인하대" , "외야수", "좌투좌타", 2019, 3500, 5000, "33", 1)
, ("이우성", "1994-07-17", 182, 95, "대전유천초", "한밭중", "대전고", null , "외야수", "우투우타", 2013, 4100, 12000, "25", 1)
, ("최형우", "1983-12-16", 180, 106, "진북초", "전주동중", "전주고", null , "외야수", "우투좌타", 2002, 90000, 5000, "34", 1)
, ("김선우", "2001-01-18", 178, 80, "상인천초", "상인천중", "강릉고", null , "포수", "우투우타", 2021, 3000, 3000, "42", 2)
, ("김규성", "1997-03-08", 183, 73, "갈산초", "선린중", "선린인터넷고", null , "내야수", "우투좌타", 2017, 4300, 4000, "13", 1)
, ("류지혁", "1994-01-13", 181, 75, "청원초", "선린중", "충암고", null , "내야수", "우투좌타", 2012, 10500, 7000, "8", 1)
, ("이준범", "2002-07-16", 184, 85, "광주대성초", "광주동성중", "광주동성고", null , "내야수", "우투우타", 2021, 3000, 3000, "011", 3)
, ("최정용", "1996-10-24", 178, 75, "서원초", "세광중", "세광고", null , "내야수", "우투좌타", 2015, 3800, 11000, "23", 1)
, ("황대인", "1996-02-10", 178, 100, "군산신풍초", "자양중", "경기고", null , "내야수", "우투우타", 2015, 6500, 16000, "52", 1)
, ("김유신", "1999-06-14", 187, 100, "화순초", "청주중", "세광고", null , "투수", "좌투좌타", 2018, 3700, 14000, "49", 1)
, ("김찬민", "2003-09-13", 184, 85, "부안동초", "이평중", "전주고", null , "투수", "우투우타", 2022, 3000, 7000, "61", 1)
, ("손진규", "1999-02-09", 183, 99, "송전초", "개군중", "장안고", "송원대" , "투수", "우투우타", 2022, 3000, 3000, "049", 3)
, ("송후섭", "1997-06-18", 190, 95, "마산양덕초", "거제외포중", "개성고", null , "투수", "우투우타", 2017, 3000, 6000, "11", 1)
, ("옥준호", "2001-08-31", 185, 96, "자양초", "자양중", "덕수고", null , "투수", "좌투좌타", 2022, 3000, 0, "029", 3)
, ("이태규", "2000-02-21", 188, 72, "희망대초", "매향중", "장안고", null , "투수", "우투좌타", 2019, 3000, 8000, "023", 1)
, ("장재혁", "2001-08-02", 180, 86, "금강초", "대신중", "경남고", null , "투수", "우투우타", 2021, 3000, 5000, "56", 1)
, ("장현식", "1995-02-24", 181, 91, "신도초", "서울이수중", "서울고", null , "투수", "우투우타", 2013, 20000, 15000, "50", 1)
, ("한승혁", "1993-01-03", 185, 96, "도신초", "강남중", "덕수고", "남부대" , "투수", "우투좌타", 2011, 5300, 18000, "26", 1)
, ("황동하", "2002-07-30", 183, 96, "전주진북초 ", " 전라중 ", " 인상고", null , "투수", "우투우타", 2022, 3000, 4000, "041", 3)
, ("나지완", "1985-05-19", 182, 105, "수유초", "신일중", "신일고", "단국대" , "외야수", "우투우타", 2008, 15000, 10000, "29", 1)
, ("류승현", "1997-07-01", 176, 84, "송정동초", "무등중", "광주제일고", null , "외야수", "우투좌타", 2016, 4000, 3000, "9", 1)
, ("박정우", "1998-02-01", 175, 68, "역삼초", "언북중", "덕수고", null , "외야수", "좌투좌타", 2017, 3500, 5000, "0", 1)
, ("이영재", "2002-01-11", 184, 96, "연현초", "평촌중", "유신고", null , "외야수", "우투우타", 2021, 3000, 6000, "03", 3)
, ("박수용", "1999-08-11", 190, 105, "용상초", "대구중", "영문고", null , "내야수", "우투우타", 2019, 3000, 4000, "05", 3)
, ("박찬호", "1995-06-05", 178, 72, "신답초", "건대부중", "장충고", null , "내야수", "우투우타", 2014, 12000, 8000, "1", 1)
, ("윤도현", "2003-05-07", 181, 84, "화정초", "무등중", "광주제일고", null , "내야수", "우투우타", 2022, 3000, 10000, "67", 1)
, ("김정빈", "1994-06-08", 182, 90, "광주화정초", "무등중", "화순고", null , "투수", "좌투좌타", 0, 3200, 8000, "24", 1)
, ("남하준", "1996-09-13", 182, 78, "원봉초", "세광중", "세광고", null , "투수", "우투좌타", 2016, 3300, 10000, "41", 1)
, ("박준표", "1992-06-26", 181, 93, "송정동초", "진흥중", "중앙고", "동강대" , "투수", "우언우타", 2013, 12500, 4000, "31", 1)
, ("서덕원", "1993-07-12", 183, 89, "개운초", "청량중", "장충고", "건국대" , "투수", "우투우타", 2016, 3600, 6000, "55", 1)
, ("이승재", "2000-10-04", 182, 82, "잠신초(강남구리틀)", "강남중", "휘문고", "강릉영동대" , "투수", "우투우타", 2021, 3600, 8000, "68", 1)
, ("이의리", "2002-06-16", 185, 90, "광주수창초", "충장중", "광주제일고", null , "투수", "좌투좌타", 2021, 9000, 30000, "48", 1)
, ("이준영", "1992-08-10", 177, 85, "군산남초", "군산중", "군산상고", "중앙대" , "투수", "좌투좌타", 2015, 6700, 8000, "20", 1)
, ("임기영", "1993-04-16", 184, 86, "대구수창초", "경운중", "경북고", null , "투수", "우완우타", 2012, 14000, 11000, "17", 1)
, ("전상현", "1996-04-18", 182, 84, "남도초", "경복중", "대구상원고", null , "투수", "우투우타", 2016, 11000, 7000, "51", 1)
, ("최용준", "2001-12-19", 193, 95, "신양초", "경남중", "부산공고", null , "투수", "우투우타", 2021, 3100, 3000, "43", 1)
, ("최지민", "2003-09-10", 185, 100, "강릉리틀", "강릉율곡초", "경포중", null , "투수", "좌투좌타", 2022, 3000, 15000, "39", 1)
, ("고종욱", "1989-01-11", 184, 83, "역삼초", "대치중", "경기고", "한양대" , "외야수", "우투좌타", 2011, 7000, 8000, "57", 1)
, ("김민수", "2000-04-05", 186, 87, "수영초", "경남중", "경남고", null , "외야수", "우투좌타", 2019, 3000, 0, "04", 3)
, ("이인한", "1998-12-24", 183, 100, "대성초", "심석중", "강릉고", "강릉영동대" , "외야수", "우투우타", 2020, 3000, 3000, "08", 3)
, ("한승연", "2003-06-09", 183, 90, "군산신풍초", "군산중", "전주고", null , "외야수", "우투우타", 2022, 3000, 3000, "028", 3)
, ("박동원", "1990-04-07", 178, 98, "양정초", "개성중", "개성고", null , "포수", "우투우타", 0, 31000, 6000, "10", 1)
, ("이성주", "2003-03-28", 183, 98, "고명초", "잠신중", "경기고", null , "포수", "우투우타", 2022, 3000, 6000, "047", 3)
, ("이정훈", "1994-12-07", 185, 90, "교문초", "배재중", "휘문고", "경희대" , "포수", "우투좌타", 2017, 4000, 3000, "12", 1)
, ("한승택", "1994-06-21", 174, 83, "잠전초(남양주리틀)", "잠신중", "덕수고", null , "포수", "우투우타", 2013, 8500, 9000, "4", 1)
, ("김도영", "2003-10-02", 183, 85, "대성초", "동성중", "동성고", null , "내야수", "우투우타", 2022, 3000, 40000, "5", 1)
, ("김석환", "1999-02-28", 187, 97, "서석초", "동성중", "동성고", null , "내야수", "좌투좌타", 2017, 3100, 9000, "35", 1)
, ("김선빈", "1989-12-18", 165, 77, "화순초", "화순중", "화순고", null , "내야수", "우투우타", 2008, 45000, 3000, "3", 1)
, ("김창용", "1996-07-09", 180, 80, "대구칠성", "대구중", "경북고", null , "내야수", "우투우타", 2019, 3000, 3000, "06", 3)
, ("강병우", "2003-12-12", 182, 88, "군산중앙초", "배명중", "배명고", null , "투수", "좌투좌타", 2022, 3000, 8000, "59", 1)
, ("나용기", "1998-11-18", 195, 105, "서석초", "충장중", "북일고", "동강대" , "투수", "우투우타", 2019, 3000, 0, "09", 3)
, ("박진태", "1994-10-19", 180, 83, "미성초", "성남중", "성남고", "건국대" , "투수", "우투우타", 2017, 6000, 11000, "46", 1)
, ("유승철", "1998-03-02", 185, 87, "순천북초", "순천이수중", "효천고", null , "투수", "우투양타", 2017, 4000, 18000, "40", 1)
, ("김호령", "1992-04-30", 178, 85, "안산관산초", "안산중앙중", "군산상고", "동국대" , "외야수", "우투우타", 2015, 6000, 3000, "27", 1)
, ("나성범", "1989-10-03", 183, 100, "대성초", "진흥중", "진흥고", "연세대" , "외야수", "좌투좌타", 2012, 200000, 30000, "47", 1)
, ("백도렬", "1999-11-23", 181, 86, "동원초", "청량중", "배제고", "연세대" , "외야수", "우투좌타", 2022, 3000, 5000, "050", 3)
, ("이창진", "1991-03-04", 173, 85, "신도초", "동인천중", "인천고", "건국대" , "외야수", "우투우타", 2014, 7000, 5000, "66", 1);

select * from players;